<?php

return [

    'attribute' => [
        'measurement' => 'Вимірювання',
    ],

    'measurement' => [
        'index' => [
            'create'   => 'Створити групу вимірювань',
            'code'     => 'Код',
            'standard' => 'Код стандартної одиниці',
            'symbol'   => 'Символ',
            'save'     => 'Зберегти',
        ],

        'edit' => [
            'measurement_edit' => 'Редагувати групу вимірювань',
            'back'             => 'Назад',
            'save'             => 'Зберегти',
            'general'          => 'Загальні',
            'code'             => 'Код',
            'label'            => 'Мітка',
            'units'            => 'Одиниці',
            'create_units'     => 'Створити одиниці',
        ],

        'unit' => [
            'edit_unit'   => 'Редагувати одиницю',
            'create_unit' => 'Створити одиницю',
            'symbol'      => 'Символ',
            'save'        => 'Зберегти',
        ],
    ],

    'attribute_type' => [
        'measurement_families' => 'Групи вимірювань',
        'measurement_family'   => 'Група вимірювань',
        'measurement_unit'     => 'Одиниця вимірювання',
    ],

    'datagrid' => [
        'labels'        => 'Мітки',
        'code'          => 'Код',
        'standard_unit' => 'Стандартна одиниця',
        'unit_count'    => 'Кількість одиниць',
        'is_standard'   => 'Позначити як стандартну одиницю',
    ],

    'messages' => [
        'family' => [
            'updated'      => 'Група вимірювань успішно оновлена.',
            'deleted'      => 'Група вимірювань успішно видалена.',
            'mass_deleted' => 'Вибрані групи вимірювань успішно видалені.',
        ],

        'unit' => [
            'not_found'         => 'Групу вимірювань не знайдено.',
            'already_exists'    => 'Код одиниці вже існує.',
            'not_foundd'        => 'Одиницю не знайдено.',
            'deleted'           => 'Одиницю успішно видалено.',
            'no_items_selected' => 'Жоден елемент не вибрано.',
            'mass_deleted'      => 'Вибрані одиниці вимірювань успішно видалені.',
        ],
    ],

];
